betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
/**
  *
  * @file    apm32f4xx_dal_qspi.c
  * @brief   QSPI DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the QSPI peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
 ===============================================================================
                     ##### How to use this driver #####
 ===============================================================================
   [..]
    *** Initialization ***
    ======================
    [..]
      (#) As prerequisite, fill in the DAL_QSPI_MspInit() :
        (++) Enable the QSPI interface clock using __DAL_RCM_QSPI_CLK_ENABLE()
        (++) Reset QSPI peripheral with __DAL_RCM_QSPI_FORCE_RESET() and 
             __DAL_RCM_QSPI_RELEASE_RESET().
        (++) Enable the clocks for the QSPI GPIOS with __DAL_GPIO_QSPI_CLK_ENABLE().
        (++) Configure these QSPI pins in alternate function mode using __DAL_GPIO_Init().
        (++) If interrupt mode is used, enable and configure QSPI global
             interrupt with DAL_NVIC_SetPriority() and DAL_NVIC_EnableIRQ().
        (++) If DMA mode is used, enable the clocks for the QSPI DMA channel
             with __DAL_DMA_QSPI_CLK_ENABLE(), configure DMA with
             DAL_DMA_Init() function and link it with QSPI handle using
             __DAL_LINKDMA(), enable and configure DMA global interrupt with
             DAL_NVIC_SetPriority() and DAL_NVIC_EnableIRQ().
        (#) Configure the baudrate, the clock phase, the clock polarity, the clock stretch,
            the data frame size, the frame format, the FIFO threshold and the sample shifting
            using the DAL_QSPI_Init() function.

    *** Errors management and abort functionality ***
    ================================================
    [..]
      (#) DAL_QSPI_GetError() function gives the error raised during the last operation.
      (#) DAL_QSPI_Abort() and DAL_QSPI_Abort_IT() functions aborts any on-going operation and
          flushes the fifo :
        (++) In polling mode, the output of the function is done when the transfer
        complete bit is set and the busy bit cleared.
        (++) In interrupt mode, DAL_QSPI_AbortCpltCallback() will be called when 
        the transfer complete bit is set.

    *** Control functions ***
    =========================
    [..]
      (#) DAL_QSPI_GetState() function gives the current state of the DAL QSPI driver.
      (#) DAL_QSPI_SetTimeout() function configures the timeout value used in the driver.
      (#) DAL_QSPI_SetTxFifoThreshold() function configures the threshold on the TX FIFO of the QSPI IP.
      (#) DAL_QSPI_SetRxFifoThreshold() function configures the threshold on the RX FIFO of the QSPI IP.
      (#) DAL_QSPI_SetTxFifoLevel() function configures the level on the TX FIFO of the QSPI IP.
      (#) DAL_QSPI_GetTxFifoThreshold() function returns the threshold on the TX FIFO of the QSPI IP.
      (#) DAL_QSPI_GetRxFifoThreshold() function returns the threshold on the RX FIFO of the QSPI IP.
      (#) DAL_QSPI_GetTxFifoLevel() function returns the level on the TX FIFO of the QSPI IP.
      (#) DAL_QSPI_SetFrameFormat() function configures the frame format of the QSPI IP.
      (#) DAL_QSPI_GetFrameFormat() function returns the frame format of the QSPI IP.
      (#) DAL_QSPI_SetDataFrameSize() function configures the data frame size of the QSPI IP.
      (#) DAL_QSPI_GetDataFrameSize() function returns the data frame size of the QSPI IP.
      (#) DAL_QSPI_SetTransferMode() function configures the transfer mode of the QSPI IP.
      (#) DAL_QSPI_GetTransferMode() function returns the transfer mode of the QSPI IP.
      (#) DAL_QSPI_SetFrameNbData() function configures the number of data frames to be sent/received.
      (#) DAL_QSPI_GetFrameNbData() function returns the number of data frames to be sent/received.

    *** Callback registration ***
    =============================
    [..]
      The compilation define USE_DAL_QSPI_REGISTER_CALLBACKS when set to 1
      allows the user to configure dynamically the driver callbacks.

