betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
      Use Functions @ref DAL_QSPI_RegisterCallback() to register a user callback,
      it allows to register following callbacks:
        (+) ErrorCallback            : callback when error occurs.
        (+) AbortCpltCallback        : callback when abort is completed.
        (+) CmdCpltCallback          : callback when command is completed.
        (+) RxCpltCallback           : callback when receive is completed.
        (+) TxCpltCallback           : callback when transmit is completed.
        (+) TxRxCpltCallback         : callback when transmit and receive are completed.
        (+) MspInitCallback          : QSPI MspInit.
        (+) MspDeInitCallback        : QSPI MspDeInit.
      This function takes as parameters the HAL peripheral handle, the Callback ID
        and a pointer to the user callback function.

        Use function @ref DAL_QSPI_UnRegisterCallback() to reset a callback to the default
        weak (surcharged) function. It allows to reset following callbacks:
          (+) ErrorCallback            : callback when error occurs.
          (+) AbortCpltCallback        : callback when abort is completed.
          (+) CmdCpltCallback          : callback when command is completed.
          (+) RxCpltCallback           : callback when receive is completed.
          (+) TxCpltCallback           : callback when transmit is completed.
          (+) TxRxCpltCallback         : callback when transmit and receive are completed.
          (+) MspInitCallback          : QSPI MspInit.
          (+) MspDeInitCallback        : QSPI MspDeInit.
        This function) takes as parameters the DAL peripheral handle and the Callback ID.

        By default, after the DAL_QSPI_Init() and if the state is DAL_QSPI_STATE_RESET
        all callbacks are reset to the corresponding legacy weak (surcharged) functions.
        Exception done for MspInit and MspDeInit callbacks that are respectively
        reset to the legacy weak (surcharged) functions in the DAL_QSPI_Init()
        and DAL_QSPI_DeInit() only when these callbacks are null (not registered beforehand).
        If not, MspInit or MspDeInit are not null, the DAL_QSPI_Init() and DAL_QSPI_DeInit()
        keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

        Callbacks can be registered/unregistered in DAL_QSPI_STATE_READY state only.
        Exception done MspInit/MspDeInit callbacks that can be registered/unregistered
        in DAL_QSPI_STATE_READY or DAL_QSPI_STATE_RESET state, thus registered (user)
        MspInit/DeInit callbacks can be used during the DAL_QSPI_Init()/DAL_QSPI_DeInit().
        In that case first register the MspInit/MspDeInit user callbacks
        using DAL_QSPI_RegisterCallback() before calling DAL_QSPI_DeInit()
        or DAL_QSPI_Init() function.

        When the compilation define USE_DAL_QSPI_REGISTER_CALLBACKS is set to 0 or
        not defined, the callback registration feature is not available and all callbacks
        are set to the corresponding legacy weak (surcharged) functions.
  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

#if defined(QSPI)

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup QSPI QSPI
 * @brief QSPI DAL module driver
  * @{
  */

#ifdef DAL_QSPI_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/** @defgroup QSPI_Private_Constants QSPI Private Constants
  * @{
  */

/* TFTL register clear mask */
#define QSPI_TFTL_CLEAR_MASK            ((uint32_t)(QSPI_TFTL_TFTH | QSPI_TFTL_TFT))

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void QSPI_DMATxCplt(DMA_HandleTypeDef *hdma);
static void QSPI_DMARxCplt(DMA_HandleTypeDef *hdma);
static void QSPI_DMAError(DMA_HandleTypeDef *hdma);
static void QSPI_DMAAbortCplt(DMA_HandleTypeDef *hdma);
static DAL_StatusTypeDef DAL_QSPI_WaitFlagStateUntilTimeout(QSPI_HandleTypeDef *hqspi, uint32_t Flag, FlagStatus State, uint32_t TickStart, uint32_t Timeout);
static void QSPI_Config(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd);

/* Exported functions --------------------------------------------------------*/
/** @defgroup QSPI_Exported_Functions QSPI Exported Functions
  * @{
  */

/** @defgroup QSPI_Exported_Functions_Group1 Initialization and de-initialization functions
 * @brief    Initialization and Configuration functions
 * 
 * @verbatim
 * ===============================================================================
 *             ##### Initialization and de-initialization functions #####
 * ===============================================================================
 *   [..]
 *    This section provides functions allowing to:
 *     (+) Initialize the QSPI.
 *     (+) De-initialize the QSPI.
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Initializes the QSPI according to the specified parameters
 *        in the DAL_QSPI_InitTypeDef and create the associated handle.
 * @param  hqspi: QSPI handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Init(QSPI_HandleTypeDef *hqspi)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();

    /* Check the QSPI handle allocation */
    if (hqspi == NULL)
    {
        return DAL_ERROR;
    }

    /* Check the parameters */
    ASSERT_PARAM(IS_QSPI_ALL_INSTANCE(hqspi->Instance));
    ASSERT_PARAM(IS_QSPI_CLOCK_PRESCALER(hqspi->Init.ClockPrescaler));
#if defined(QSPI_CTRL1_CPHA)
    ASSERT_PARAM(IS_QSPI_CLOCK_PHASE(hqspi->Init.ClockPhase));
#endif /* QSPI_CTRL1_CPHA */
#if defined(QSPI_CTRL1_CPOL)
    ASSERT_PARAM(IS_QSPI_CLOCK_POLARITY(hqspi->Init.ClockPolarity));
#endif /* QSPI_CTRL1_CPOL */
    ASSERT_PARAM(IS_QSPI_CLOCK_STRETCH(hqspi->Init.ClockStretch));
    ASSERT_PARAM(IS_QSPI_TX_FIFO_THRESHOLD(hqspi->Init.TxFifoThreshold));
    ASSERT_PARAM(IS_QSPI_TX_FIFO_LEVEL(hqspi->Init.TxFifoLevel));
    ASSERT_PARAM(IS_QSPI_RX_FIFO_THRESHOLD(hqspi->Init.RxFifoThreshold));
    ASSERT_PARAM(IS_QSPI_CHIP_SELECT_TOGGLE(hqspi->Init.ChipSelectToggle));

    if (hqspi->State == DAL_QSPI_STATE_RESET)
    {

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
        /* Reset callback pointers to the legacy weak (surcharged) functions */
        hqspi->ErrorCallback = DAL_QSPI_ErrorCallback;
        hqspi->AbortCpltCallback = DAL_QSPI_AbortCpltCallback;
        hqspi->CmdCpltCallback = DAL_QSPI_CmdCpltCallback;
        hqspi->RxCpltCallback = DAL_QSPI_RxCpltCallback;
        hqspi->TxCpltCallback = DAL_QSPI_TxCpltCallback;
        hqspi->TxRxCpltCallback = DAL_QSPI_TxRxCpltCallback;

        if (hqspi->MspInitCallback == NULL)
        {
            hqspi->MspInitCallback = DAL_QSPI_MspInit;
        }

        /* Init the low level hardware */
        hqspi->MspInitCallback(hqspi);
#else
        /* Init the low level hardware : GPIO, CLOCK, NVIC... */
        DAL_QSPI_MspInit(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

