betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
        /* Configure the default timeout for the QSPI memory access */
        DAL_QSPI_SetTimeout(hqspi, DAL_QSPI_TIMEOUT_DEFAULT_VALUE);
    }

    /* Configure QSPI FIFO Threshold */
    MODIFY_REG(hqspi->Instance->TFTL, QSPI_TFTL_CLEAR_MASK, \
                ((hqspi->Init.TxFifoThreshold << QSPI_TFTL_TFT_Pos) |
                 (hqspi->Init.TxFifoLevel << QSPI_TFTL_TFTH_Pos)));

    MODIFY_REG(hqspi->Instance->RFTL, QSPI_RFTL_RFT, hqspi->Init.RxFifoThreshold << QSPI_RFTL_RFT_Pos);

    /* Wait till BUSY flag reset */
    status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, hqspi->Timeout);

    if (status == DAL_OK)
    {
        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Disable the Slave Select signal */
        __DAL_QSPI_DISABLE_SS(hqspi);

        /* Configure QSPI Parameters */
#if defined(QSPI_CTRL1_CPHA)
        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_CPHA, hqspi->Init.ClockPhase);
#endif /* QSPI_CTRL1_CPHA */

#if defined(QSPI_CTRL1_CPOL)
        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_CPOL, hqspi->Init.ClockPolarity);
#endif /* QSPI_CTRL1_CPOL */

        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_SSTEN, hqspi->Init.ChipSelectToggle);

        /* Configure QSPI Clock Prescaler */
        MODIFY_REG(hqspi->Instance->BR, QSPI_BR_CLKDIV, hqspi->Init.ClockPrescaler << QSPI_BR_CLKDIV_Pos);

        /* Configure QSPI Clock Stretcher */
        MODIFY_REG(hqspi->Instance->CTRL3, QSPI_CTRL3_CSEN, hqspi->Init.ClockStretch << QSPI_CTRL3_CSEN_Pos);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);

        /* Set QSPI error code to none */
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        /* Initialize the QSPI state */
        hqspi->State = DAL_QSPI_STATE_READY;
    }

    /* Return function status */
    return status;
}

/**
 * @brief  De-Initializes the QSPI peripheral
 * @param  hqspi: QSPI handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_DeInit(QSPI_HandleTypeDef *hqspi)
{
    /* Check the QSPI handle allocation */
    if (hqspi == NULL)
    {
        return DAL_ERROR;
    }

    /* Check the parameters */
    ASSERT_PARAM(IS_QSPI_ALL_INSTANCE(hqspi->Instance));

    /* Disable the QSPI Peripheral */
    __DAL_QSPI_DISABLE(hqspi);

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
    if (hqspi->MspDeInitCallback == NULL)
    {
        hqspi->MspDeInitCallback = DAL_QSPI_MspDeInit;
    }

    /* DeInit the low level hardware */
    hqspi->MspDeInitCallback(hqspi);
#else
    /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
    DAL_QSPI_MspDeInit(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

    /* Set QSPI error code to none */
    hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

    /* Initialize the QSPI state */
    hqspi->State = DAL_QSPI_STATE_RESET;

    /* Return function status */
    return DAL_OK;
}

/**
 * @brief  Initializes the QSPI MSP.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_MspInit(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_MspInit could be implemented in the user file
     */
}

/**
 * @brief  DeInitializes QSPI MSP.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_MspDeInit(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_MspDeInit could be implemented in the user file
     */
}

/**
  * @}
  */

/** @defgroup QSPI_Exported_Functions_Group2 Input and Output operation functions
 *  @brief   Data transfers functions
 * 
 * @verbatim
 * ===============================================================================
 *                ##### Input and Output operation functions #####
 * ===============================================================================
 *   [..]
 *   This subsection provides a set of functions allowing to :
 *      (+) Handle the interrupts.
 *      (+) Handle the command sequence.
 *      (+) Handle the data transmission.
 *      (+) Handle the data reception.
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Handle QSPI interrupt request.
 * @param  hqspi: QSPI handle
 * @retval None
 */
void DAL_QSPI_IRQHandler(QSPI_HandleTypeDef *hqspi)
{
    __IO uint32_t *data_reg;
    uint32_t flag = READ_REG(hqspi->Instance->STS);
    uint32_t isrflags = READ_REG(hqspi->Instance->ISTS);
    uint32_t itsource = READ_REG(hqspi->Instance->INTEN);
    uint32_t errorFlags = 0x00U;

#if defined(QSPI_ISTS_MSTIF)
    errorFlags = (isrflags & (uint32_t)(QSPI_ISTS_TFOIF | QSPI_ISTS_RFUIF | QSPI_ISTS_RFOIF | QSPI_ISTS_MSTIF));
#else
    errorFlags = (isrflags & (uint32_t)(QSPI_ISTS_TFOIF | QSPI_ISTS_RFUIF | QSPI_ISTS_RFOIF));
#endif /* QSPI_ISTS_MSTIF */

    /* If some errors occur */
    if (errorFlags != RESET)
    {
        /* Fifo TX overflow interrupt occurred --------------------------------*/
        if (((isrflags & QSPI_IT_TFO) != RESET) && ((itsource & QSPI_IT_TFO) != RESET))
        {
            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_TFO);

            /* Set QSPI error code to FIFO Threshold Overrun error */
            hqspi->ErrorCode |= DAL_QSPI_ERROR_TX_OVR;
        }

        /* Fifo RX underflow interrupt occurred -------------------------------*/
        if (((isrflags & QSPI_IT_RFU) != RESET) && ((itsource & QSPI_IT_RFU) != RESET))
        {
            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_RFU);

            /* Set QSPI error code to FIFO Threshold Underrun error */
            hqspi->ErrorCode |= DAL_QSPI_ERROR_RX_UDR;
        }

        /* Fifo RX overflow interrupt occurred --------------------------------*/
        if (((isrflags & QSPI_IT_RFO) != RESET) && ((itsource & QSPI_IT_RFO) != RESET))
        {
            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_RFO);

            /* Set QSPI error code to FIFO Threshold Overrun error */
            hqspi->ErrorCode |= DAL_QSPI_ERROR_RX_OVR;
        }

