betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
#if defined(QSPI_INTEN_MSTIE)
        /* Master complete interrupt occurred ---------------------------------*/
        if (((isrflags & QSPI_IT_MST) != RESET) && ((itsource & QSPI_IT_MST) != RESET))
        {
            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_MST);

            /* Set QSPI error code to Master error */
            hqspi->ErrorCode |= DAL_QSPI_ERROR_MST;
        }
#endif /* QSPI_INTEN_MSTIE */

        /* Call QSPI Error call back function if need be ----------------------*/
        if (hqspi->ErrorCode != DAL_QSPI_ERROR_NONE)
        {
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Call error callback */
            hqspi->ErrorCallback(hqspi);
#else
            /* Call legacy weak error callback */
            DAL_QSPI_ErrorCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

            hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;
        }
        return;
    }

    /* Fifo tx empty interrupt or rx full interrupt occurred ------------------*/
    if ((((flag & QSPI_FLAG_TFN) != RESET) && ((itsource & QSPI_IT_TFE) != RESET)) || \
        (((isrflags & QSPI_FLAG_RFF) != RESET) && ((itsource & QSPI_IT_RFF) != RESET)))
    {
        data_reg = &hqspi->Instance->DATA;

        if (hqspi->State == DAL_QSPI_STATE_BUSY_TX)
        {
            /* Transmission process */
            while (hqspi->TxXferCount > 0U)
            {
                while (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_TFN) == RESET);

                /* Write data to TX FIFO */
                *((__IO uint8_t *)data_reg) = (*hqspi->pTxBuffPtr);
                hqspi->pTxBuffPtr++;
                hqspi->TxXferCount--;

                if (hqspi->TxXferCount == 0)
                {
                    /* Disable the QSPI FIFO Threshold interrupt */
                    __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_TFE);
                    break;
                }
            }

            /* Set QSPI state to Ready */
            hqspi->State = DAL_QSPI_STATE_READY;

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Call Tx complete callback */
            hqspi->TxCpltCallback(hqspi);
#else
            /* Call legacy weak Tx complete callback */
            DAL_QSPI_TxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
        else if (hqspi->State == DAL_QSPI_STATE_BUSY_RX)
        {
            /* Receiving process */
            while (hqspi->RxXferCount > 0U)
            {
                while(__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_RFNE) == RESET);

                /* Read data from RX FIFO */
                *hqspi->pRxBuffPtr = *((__IO uint8_t *)data_reg);
                hqspi->pRxBuffPtr++;
                hqspi->RxXferCount--;

                if (hqspi->RxXferCount == 0)
                {
                    /* Disable the QSPI FIFO Threshold interrupt */
                    __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_RFF);
                    break;
                }
            }

            /* Set QSPI state to Ready */
            hqspi->State = DAL_QSPI_STATE_READY;

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Call Rx complete callback */
            hqspi->RxCpltCallback(hqspi);
#else
            /* Call legacy weak Rx complete callback */
            DAL_QSPI_RxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
        else if (hqspi->State == DAL_QSPI_STATE_BUSY_TX_RX)
        {
            /* Transmission and receiving process */
            while (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_TFN) != RESET)
            {
                if (hqspi->TxXferCount > 0U)
                {
                    /* Send the byte */
                    *((__IO uint8_t *)data_reg) = (*hqspi->pTxBuffPtr);
                    hqspi->pTxBuffPtr++;
                    hqspi->TxXferCount--;

                    while((__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_RFNE) != SET) || \
                            (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_BUSY) != RESET));

                    /* Receive the byte */
                    *hqspi->pRxBuffPtr = *((__IO uint8_t *)data_reg);
                    hqspi->pRxBuffPtr++;
                    hqspi->RxXferCount--;
                }
                else
                {
                    /* No more data available for the transfer */
                    /* Disable the QSPI FIFO Threshold interrupt */
                    __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_TFE);
                    break;
                }
            }

            /* Set QSPI state to Ready */
            hqspi->State = DAL_QSPI_STATE_READY;

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Call Tx and Rx complete callback */
            hqspi->TxRxCpltCallback(hqspi);
#else
            /* Call legacy weak Tx and Rx complete callback */
            DAL_QSPI_TxRxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
        else if(hqspi->State == DAL_QSPI_STATE_BUSY)
        {
            /* Set QSPI state to Ready */
            hqspi->State = DAL_QSPI_STATE_READY;

            /* Disable the QSPI FIFO Threshold interrupt */
            __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_TFE);

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            /* Call Command complete callback */
            hqspi->CmdCpltCallback(hqspi);
#else
            /* Call legacy weak Command complete callback */
            DAL_QSPI_CmdCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
        else
        {
            /* Nothing to do */
        }

        /* Wait till BUSY flag reset */
        while (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_BUSY) != RESET);
    }
}

/**
 * @brief  Set the command configuration.
 * @param  hqspi: QSPI handle
 * @param  cmd: structure that contains the command configuration information
 * @param  Timeout: Timeout duration
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Command(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd, uint32_t Timeout)
{
    DAL_StatusTypeDef status;
    uint32_t tickstart = DAL_GetTick();

    /* Check the parameters */
    ASSERT_PARAM(IS_QSPI_INSTRUCTION_MODE(cmd->InstructionMode));
    ASSERT_PARAM(IS_QSPI_INSTRUCTION_SIZE(cmd->InstructionSize));
    ASSERT_PARAM(IS_QSPI_INSTRUCTION(cmd->Instruction));
    ASSERT_PARAM(IS_QSPI_ADDRESS_SIZE(cmd->AddressSize));
    ASSERT_PARAM(IS_QSPI_TRANSFER_MODE(cmd->TransferMode));
    ASSERT_PARAM(IS_QSPI_FRAME_FORMAT(cmd->FrameFormat));
    ASSERT_PARAM(IS_QSPI_DATA_FRAME_SIZE(cmd->DataFrameSize));
    ASSERT_PARAM(IS_QSPI_DUMMY_CYCLES(cmd->DummyCycles));

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_BUSY;

        status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, Timeout);

        if (status == DAL_OK)
        {
            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Call the configuration function */
            QSPI_Config(hqspi, cmd);

