betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
            /* Enable the Slave Select signal */
            __DAL_QSPI_ENABLE_SS(hqspi);

            /* Enable the QSPI peripheral */
            __DAL_QSPI_ENABLE(hqspi);

            /* Send the command */
            if (cmd->InstructionSize != QSPI_INSTRUCTION_SIZE_NONE)
            {
                WRITE_REG(hqspi->Instance->DATA, cmd->Instruction);
            }

            /* Send the address */
            if (cmd->AddressSize != QSPI_ADDRESS_SIZE_NONE)
            {
                WRITE_REG(hqspi->Instance->DATA, cmd->Address);
            }

            if (cmd->NbData == 0U)
            {
                if (status == DAL_OK)
                {
                    status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, hqspi->Timeout);
                }
            }

            if (status == DAL_OK)
            {
                /* Update QSPI state */
                hqspi->State = DAL_QSPI_STATE_READY;
            }
        }
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    /* Return function status */
    return status;
}

/**
 * @brief  Set the command configuration in interrupt mode.
 * @param  hqspi: QSPI handle
 * @param  cmd: structure that contains the command configuration information
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Command_IT(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();

    /* Check the parameters */
    ASSERT_PARAM(IS_QSPI_INSTRUCTION_MODE(cmd->InstructionMode));
    ASSERT_PARAM(IS_QSPI_INSTRUCTION_SIZE(cmd->InstructionSize));
    ASSERT_PARAM(IS_QSPI_INSTRUCTION(cmd->Instruction));
    ASSERT_PARAM(IS_QSPI_ADDRESS_SIZE(cmd->AddressSize));
    ASSERT_PARAM(IS_QSPI_TRANSFER_MODE(cmd->TransferMode));
    ASSERT_PARAM(IS_QSPI_FRAME_FORMAT(cmd->FrameFormat));
    ASSERT_PARAM(IS_QSPI_DATA_FRAME_SIZE(cmd->DataFrameSize));
    ASSERT_PARAM(IS_QSPI_DUMMY_CYCLES(cmd->DummyCycles));

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_BUSY;

        status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, hqspi->Timeout);

        if (status == DAL_OK)
        {
            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Call the configuration function */
            QSPI_Config(hqspi, cmd);

            /* Enable the Slave Select signal */
            __DAL_QSPI_ENABLE_SS(hqspi);

            /* Enable the QSPI peripheral */
            __DAL_QSPI_ENABLE(hqspi);

            /* Send the command */
            if (cmd->InstructionSize != QSPI_INSTRUCTION_SIZE_NONE)
            {
                WRITE_REG(hqspi->Instance->DATA, cmd->Instruction);
            }

            /* Send the address */
            if (cmd->AddressSize != QSPI_ADDRESS_SIZE_NONE)
            {
                WRITE_REG(hqspi->Instance->DATA, cmd->Address);
            }

            if (cmd->NbData == 0U)
            {
                /* Process unlocked */
                __DAL_UNLOCK(hqspi);

                /* Enable the QSPI interrupt */
                __DAL_QSPI_ENABLE_IT(hqspi, (QSPI_IT_TFE));
            }
            else
            {
                /* Update QSPI state */
                hqspi->State = DAL_QSPI_STATE_READY;

                /* Process unlocked */
                __DAL_UNLOCK(hqspi);
            }
        }
        else
        {
            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    /* Return function status */
    return status;
}

/**
 * @brief  Transmit and Receive a byte in blocking mode.
 * @param  hqspi: QSPI handle
 * @param  data_in: received data
 * @param  data_out: transmitted data
 * @param  Size: number of bytes to transmit and receive
 * @param  Timeout: Timeout duration
 * @retval DAL status
 * @note   This function is used only in case of standard communication mode.
 */
DAL_StatusTypeDef DAL_QSPI_TransmitReceive(QSPI_HandleTypeDef *hqspi, uint8_t *data_out, uint8_t *data_in, uint32_t Size, uint32_t Timeout)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();
    __IO uint32_t *data_reg = &hqspi->Instance->DATA;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if ((data_in != NULL) && (data_out != NULL))
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_TX_RX;

            hqspi->pTxBuffPtr = data_out;
            hqspi->TxXferSize = Size;
            hqspi->TxXferCount = Size;

            hqspi->pRxBuffPtr = data_in;
            hqspi->RxXferSize = Size;
            hqspi->RxXferCount = Size;

            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Configure CTRL1 */
            MODIFY_REG(hqspi->Instance->CTRL1, \
                        (QSPI_CTRL1_DFS | QSPI_CTRL1_FRF | QSPI_CTRL1_TXMODE), \
                        (QSPI_DATA_FRAME_SIZE_8BITS | QSPI_FRAME_FORMAT_STANDARD | QSPI_TRANSFER_MODE_TX_RX));

            /* Enable the Slave Select signal */
            __DAL_QSPI_ENABLE_SS(hqspi);

            /* Enable the QSPI peripheral */
            __DAL_QSPI_ENABLE(hqspi);

            /* Transmit and Receive data */
            while (hqspi->TxXferCount > 0U)
            {
                /* Wait till TFN flag set */
                status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_TFN, SET, tickstart, Timeout);

                if (status != DAL_OK)
                {
                    break;
                }
                
                /* Send the byte */
                *((__IO uint8_t *)data_reg) = (*hqspi->pTxBuffPtr);
                hqspi->pTxBuffPtr++;
                hqspi->TxXferCount--;

                /* Wait till RFNE flag set or BUSY flag reset */
                while (((__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_RFNE)) != SET) || \
                        ((__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_BUSY)) != RESET))
                {
                    /* Check for the Timeout */
                    if (Timeout != DAL_MAX_DELAY)
                    {
                        if (((DAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
                        {
                            hqspi->State = DAL_QSPI_STATE_ERROR;
                            hqspi->ErrorCode |= DAL_QSPI_ERROR_TIMEOUT;

