betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
                            status = DAL_ERROR;
                        }
                    }
                }

                if (status != DAL_OK)
                {
                    break;
                }

                /* Receive the byte */
                *hqspi->pRxBuffPtr = *((__IO uint8_t *)data_reg);
                hqspi->pRxBuffPtr++;
                hqspi->RxXferCount--;
            }

            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_READY;
        }
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Transmit and Receive an amount of data in non-blocking mode with Interrupt.
 * @param  hqspi: QSPI handle
 * @param  data_in: received data
 * @param  data_out: transmitted data
 * @param  Size: number of bytes to transmit and receive
 * @retval DAL status
 * @note   This function is used only in case of standard communication mode.
 */
DAL_StatusTypeDef DAL_QSPI_TransmitReceive_IT(QSPI_HandleTypeDef *hqspi, uint8_t *data_out, uint8_t *data_in, uint32_t Size)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if ((data_in != NULL) && (data_out != NULL))
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_TX_RX;

            hqspi->pTxBuffPtr = data_out;
            hqspi->TxXferSize = Size;
            hqspi->TxXferCount = Size;

            hqspi->pRxBuffPtr = data_in;
            hqspi->RxXferSize = Size;
            hqspi->RxXferCount = Size;

            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Configure CTRL1 */
            MODIFY_REG(hqspi->Instance->CTRL1, \
                        (QSPI_CTRL1_DFS | QSPI_CTRL1_FRF | QSPI_CTRL1_TXMODE), \
                        (QSPI_DATA_FRAME_SIZE_8BITS | QSPI_FRAME_FORMAT_STANDARD | QSPI_TRANSFER_MODE_TX_RX));

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);

            /* Enable the QSPI interrupt */
            __DAL_QSPI_ENABLE_IT(hqspi, (QSPI_IT_TFE));

            /* Enable the Slave Select signal */
            __DAL_QSPI_ENABLE_SS(hqspi);

            /* Enable the QSPI peripheral */
            __DAL_QSPI_ENABLE(hqspi);

        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    return status;
}

/**
 * @brief  Transmit an amount of data in blocking mode.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @param  Timeout: Timeout duration
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Transmit(QSPI_HandleTypeDef *hqspi, uint8_t *pData, uint32_t Timeout)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();
    __IO uint32_t *data_reg = &hqspi->Instance->DATA;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_TX;

            hqspi->pTxBuffPtr = pData;
            hqspi->TxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->TxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            /* Transmit and Receive data */
            while (hqspi->TxXferCount > 0U)
            {
                /* Wait till TFN flag set */
                status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_TFN, SET, tickstart, Timeout);

                if (status != DAL_OK)
                {
                    break;
                }
                
                /* Send the byte */
                *((__IO uint8_t *)data_reg) = (*hqspi->pTxBuffPtr);
                hqspi->pTxBuffPtr++;
                hqspi->TxXferCount--;
            }

            if (status == DAL_OK)
            {
                /* Wait till BUSY flag reset */
                status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, Timeout);
            }

            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_READY;
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;
        }
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Transmit an amount of data in non-blocking mode with Interrupt.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Transmit_IT(QSPI_HandleTypeDef *hqspi, uint8_t *pData)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_TX;

            hqspi->pTxBuffPtr = pData;
            hqspi->TxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->TxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_TFE);

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);

            /* Enable the QSPI interrupt */
            __DAL_QSPI_ENABLE_IT(hqspi, (QSPI_IT_TFE));
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

