betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    return status;
}

/**
 * @brief  Transmit an amount of data in non-blocking mode with DMA.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Transmit_DMA(QSPI_HandleTypeDef *hqspi, uint8_t *pData)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Clear the error code */
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_TX;

            hqspi->pTxBuffPtr = pData;
            hqspi->TxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->TxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            /* Set the QSPI DMA transfer complete callback */
            hqspi->hdmatx->XferCpltCallback = QSPI_DMATxCplt;

            /* Set the QSPI DMA error callback */
            hqspi->hdmatx->XferErrorCallback = QSPI_DMAError;

            /* Clear the DMA abort callback */
            hqspi->hdmatx->XferAbortCallback = NULL;

            /* Enable the DMA stream */
            if (DAL_DMA_Start_IT(hqspi->hdmatx, (uint32_t)hqspi->pTxBuffPtr, (uint32_t)&hqspi->Instance->DATA, hqspi->TxXferCount) == DAL_OK)
            {
                /* Clear interrupt */
                __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_TFE);

                /* Process unlocked */
                __DAL_UNLOCK(hqspi);

                /* Enable the QSPI DMA transfer for transmit request by setting the TDMAEN bit
                in the QSPI DMACTRL register */
                SET_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_TDMAEN);
            }
            else
            {
                status = DAL_ERROR;
                hqspi->ErrorCode |= DAL_QSPI_ERROR_DMA;
                hqspi->State = DAL_QSPI_STATE_READY;

                /* Process unlocked */
                __DAL_UNLOCK(hqspi);
            }
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    return status;
}

/**
 * @brief  Receive an amount of data in blocking mode.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @param  Timeout: Timeout duration
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Receive(QSPI_HandleTypeDef *hqspi, uint8_t *pData, uint32_t Timeout)
{
    DAL_StatusTypeDef status;
    uint32_t tickstart = DAL_GetTick();
    __IO uint32_t *data_reg = &hqspi->Instance->DATA;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_RX;

            hqspi->pRxBuffPtr = pData;
            hqspi->RxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->RxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            while (hqspi->RxXferCount > 0U)
            {
                /* Wait till RFNE flag set */
                status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_RFNE, SET, tickstart, Timeout);

                if (status != DAL_OK)
                {
                    break;
                }

                /* Receive the byte */
                *hqspi->pRxBuffPtr = *((__IO uint8_t *)data_reg);
                hqspi->pRxBuffPtr++;
                hqspi->RxXferCount--;
            }

            if (status == DAL_OK)
            {
                /* Wait till BUSY flag reset */
                status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, Timeout);
            }

            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_READY;
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;
        }
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Receive an amount of data in non-blocking mode with Interrupt.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Receive_IT(QSPI_HandleTypeDef *hqspi, uint8_t *pData)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_RX;

            hqspi->pRxBuffPtr = pData;
            hqspi->RxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->RxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            /* Clear interrupt */
            __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_RFF);

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);

            /* Enable the QSPI interrupt */
            __DAL_QSPI_ENABLE_IT(hqspi, (QSPI_IT_RFF));
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    return status;
}

/**
 * @brief  Receive an amount of data in non-blocking mode with DMA.
 * @param  hqspi: QSPI handle
 * @param  pData: pointer to data buffer
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Receive_DMA(QSPI_HandleTypeDef *hqspi, uint8_t *pData)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Clear the error code */
        hqspi->ErrorCode = DAL_QSPI_ERROR_NONE;

