betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
        if (pData != NULL)
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_BUSY_RX;

            hqspi->pRxBuffPtr = pData;
            hqspi->RxXferSize = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;
            hqspi->RxXferCount = READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) + 1U;

            /* Set the QSPI DMA transfer complete callback */
            hqspi->hdmarx->XferCpltCallback = QSPI_DMARxCplt;

            /* Set the QSPI DMA error callback */
            hqspi->hdmarx->XferErrorCallback = QSPI_DMAError;

            /* Clear the DMA abort callback */
            hqspi->hdmarx->XferAbortCallback = NULL;

            /* Enable the DMA stream */
            if (DAL_DMA_Start_IT(hqspi->hdmarx, (uint32_t)&hqspi->Instance->DATA, (uint32_t)hqspi->pRxBuffPtr, hqspi->RxXferCount) == DAL_OK)
            {
                /* Clear interrupt */
                __DAL_QSPI_CLEAR_FLAG(hqspi, QSPI_IT_RFF);

                /* Process unlocked */
                __DAL_UNLOCK(hqspi);

                /* Enable the QSPI DMA transfer for receive request by setting the RDMAEN bit
                in the QSPI DMACTRL register */
                SET_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_RDMAEN);
            }
            else
            {
                status = DAL_ERROR;
                hqspi->ErrorCode |= DAL_QSPI_ERROR_DMA;
                hqspi->State = DAL_QSPI_STATE_READY;

                /* Process unlocked */
                __DAL_UNLOCK(hqspi);
            }
        }
        else
        {
            hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_PARAM;
            status = DAL_ERROR;

            /* Process unlocked */
            __DAL_UNLOCK(hqspi);
        }
    }
    else
    {
        status = DAL_BUSY;

        /* Process unlocked */
        __DAL_UNLOCK(hqspi);
    }

    return status;
}

/**
 * @brief  Transfer error callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_ErrorCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_ErrorCallback could be implemented in the user file
     */
}

/**
 * @brief  Abort completed callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_AbortCpltCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_AbortCpltCallback could be implemented in the user file
     */
}

/**
 * @brief  FIFO threshold callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_FifoThresholdCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_FifoThresholdCallback could be implemented in the user file
     */
}

/**
 * @brief  Command completed callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_CmdCpltCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_CmdCpltCallback could be implemented in the user file
     */
}

/**
 * @brief  Rx Transfer completed callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_RxCpltCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_RxCpltCallback could be implemented in the user file
     */
}

/**
 * @brief  Tx Transfer completed callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_TxCpltCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_TxCpltCallback could be implemented in the user file
     */
}

/**
 * @brief  Tx and Rx Transfer completed callback.
 * @param  hqspi: QSPI handle
 * @retval None
 */
__weak void DAL_QSPI_TxRxCpltCallback(QSPI_HandleTypeDef *hqspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hqspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the DAL_QSPI_TxRxCpltCallback could be implemented in the user file
     */
}

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
/**
 * @brief  Register a User QSPI Callback
 *         To be used instead of the weak predefined callback
 * @param  hqspi: QSPI handle
 * @param  CallbackID: ID of the callback to be registered
 *                    This parameter can be one of the following values:
 *                    @arg @ref DAL_QSPI_ERROR_CB_ID          QSPI Error Callback ID
 *                    @arg @ref DAL_QSPI_ABORT_CB_ID          QSPI Abort Callback ID
 *                    @arg @ref DAL_QSPI_CMD_CPLT_CB_ID       QSPI Command Complete Callback ID
 *                    @arg @ref DAL_QSPI_RX_CPLT_CB_ID        QSPI Rx Complete Callback ID
 *                    @arg @ref DAL_QSPI_TX_CPLT_CB_ID        QSPI Tx Complete Callback ID
 *                    @arg @ref DAL_QSPI_TX_RX_CPLT_CB_ID     QSPI Tx Rx Complete Callback ID
 *                    @arg @ref DAL_QSPI_MSP_INIT_CB_ID       QSPI MspInit Callback ID
 *                    @arg @ref DAL_QSPI_MSP_DEINIT_CB_ID     QSPI MspDeInit Callback ID
 * @param  pCallback: pointer to the Callback function
 * @retval status
 */
DAL_StatusTypeDef DAL_QSPI_RegisterCallback(QSPI_HandleTypeDef *hqspi, DAL_QSPI_CallbackIDTypeDef CallbackID, pQSPI_CallbackTypeDef pCallback)
{
    DAL_StatusTypeDef status = DAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

        return DAL_ERROR;
    }

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        switch (CallbackID)
        {
            case DAL_QSPI_ERROR_CB_ID :
                hqspi->ErrorCallback = pCallback;
                break;

            case DAL_QSPI_ABORT_CB_ID :
                hqspi->AbortCpltCallback = pCallback;
                break;

