betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
            case DAL_QSPI_CMD_CPLT_CB_ID :
                hqspi->CmdCpltCallback = pCallback;
                break;

            case DAL_QSPI_RX_CPLT_CB_ID :
                hqspi->RxCpltCallback = pCallback;
                break;

            case DAL_QSPI_TX_CPLT_CB_ID :
                hqspi->TxCpltCallback = pCallback;
                break;

            case DAL_QSPI_TX_RX_CPLT_CB_ID :
                hqspi->TxRxCpltCallback = pCallback;
                break;

            case DAL_QSPI_MSP_INIT_CB_ID :
                hqspi->MspInitCallback = pCallback;
                break;

            case DAL_QSPI_MSP_DEINIT_CB_ID :
                hqspi->MspDeInitCallback = pCallback;
                break;

            default :
                /* Update the error code */
                hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status =  DAL_ERROR;
                break;
        }
    }
    else if (hqspi->State == DAL_QSPI_STATE_RESET)
    {
        switch (CallbackID)
        {
            case DAL_QSPI_MSP_INIT_CB_ID :
                hqspi->MspInitCallback = pCallback;
                break;

            case DAL_QSPI_MSP_DEINIT_CB_ID :
                hqspi->MspDeInitCallback = pCallback;
                break;

            default :
                /* Update the error code */
                hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status =  DAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

        /* Update return status */
        status = DAL_ERROR;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Unregister a User QSPI Callback
 *         QSPI Callback is redirected to the weak predefined callback
 * @param  hqspi: QSPI handle
 * @param  CallbackID: ID of the callback to be unregistered
 *                    This parameter can be one of the following values:
 *                    @arg @ref DAL_QSPI_ERROR_CB_ID          QSPI Error Callback ID
 *                    @arg @ref DAL_QSPI_ABORT_CB_ID          QSPI Abort Callback ID
 *                    @arg @ref DAL_QSPI_CMD_CPLT_CB_ID       QSPI Command Complete Callback ID
 *                    @arg @ref DAL_QSPI_RX_CPLT_CB_ID        QSPI Rx Complete Callback ID
 *                    @arg @ref DAL_QSPI_TX_CPLT_CB_ID        QSPI Tx Complete Callback ID
 *                    @arg @ref DAL_QSPI_TX_RX_CPLT_CB_ID     QSPI Tx Rx Complete Callback ID
 *                    @arg @ref DAL_QSPI_MSP_INIT_CB_ID       QSPI MspInit Callback ID
 *                    @arg @ref DAL_QSPI_MSP_DEINIT_CB_ID     QSPI MspDeInit Callback ID
 * @retval status
 */
DAL_StatusTypeDef DAL_QSPI_UnRegisterCallback(QSPI_HandleTypeDef *hqspi, DAL_QSPI_CallbackIDTypeDef CallbackID)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        switch (CallbackID)
        {
            case DAL_QSPI_ERROR_CB_ID :
                hqspi->ErrorCallback = DAL_QSPI_ErrorCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_ABORT_CB_ID :
                hqspi->AbortCpltCallback = DAL_QSPI_AbortCpltCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_CMD_CPLT_CB_ID :
                hqspi->CmdCpltCallback = DAL_QSPI_CmdCpltCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_RX_CPLT_CB_ID :
                hqspi->RxCpltCallback = DAL_QSPI_RxCpltCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_TX_CPLT_CB_ID :
                hqspi->TxCpltCallback = DAL_QSPI_TxCpltCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_TX_RX_CPLT_CB_ID :
                hqspi->TxRxCpltCallback = DAL_QSPI_TxRxCpltCallback; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_MSP_INIT_CB_ID :
                hqspi->MspInitCallback = DAL_QSPI_MspInit; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_MSP_DEINIT_CB_ID :
                hqspi->MspDeInitCallback = DAL_QSPI_MspDeInit; /* Legacy weak (surcharged) callback */
                break;

            default :
                /* Update the error code */
                hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status =  DAL_ERROR;
                break;
        }
    }
    else if (hqspi->State == DAL_QSPI_STATE_RESET)
    {
        switch (CallbackID)
        {
            case DAL_QSPI_MSP_INIT_CB_ID :
                hqspi->MspInitCallback = DAL_QSPI_MspInit; /* Legacy weak (surcharged) callback */
                break;

            case DAL_QSPI_MSP_DEINIT_CB_ID :
                hqspi->MspDeInitCallback = DAL_QSPI_MspDeInit; /* Legacy weak (surcharged) callback */
                break;

            default :
                /* Update the error code */
                hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

                /* Return error status */
                status =  DAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hqspi->ErrorCode |= DAL_QSPI_ERROR_INVALID_CALLBACK;

        /* Update return status */
        status = DAL_ERROR;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup QSPI_Exported_Functions_Group3 Peripheral Control functions
 *   @brief   QSPI control and state functions
 * 
 * @verbatim
 * ===============================================================================
 *                 ##### Peripheral Control and State functions #####
 * ===============================================================================
 *  [..]
 *  This subsection provides a set of functions allowing to :
 *    (+) Check in run-time the state of the driver. 
 *    (+) Check the error code set during last operation.
 *    (+) Abort any operation.
 * 
 * @endverbatim
  * @{
  */

/**
 * @brief  Reture the QSPI handle state.
 * @param  hqspi QSPI handle
 * @retval DAL state
 */
DAL_QSPI_StateTypeDef DAL_QSPI_GetState(QSPI_HandleTypeDef *hqspi)
{
    /* Return QSPI handle state */
    return hqspi->State;
}

/**
 * @brief  Return the QSPI error code.
 * @param  hqspi QSPI handle
 * @retval DAL error code
 */
uint32_t DAL_QSPI_GetError(QSPI_HandleTypeDef *hqspi)
{
    /* Return QSPI error code */
    return hqspi->ErrorCode;
}

/**
 * @brief  Abort the current transmission.
 * @param  hqspi QSPI handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Abort(QSPI_HandleTypeDef *hqspi)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();

    /* Check if the state is in one of the busy states */
    if (((uint32_t)hqspi->State & 0x02) != 0U)
    {
        /* Process locked */
        __DAL_LOCK(hqspi);

        if ((hqspi->Instance->DMACTRL & QSPI_DMACTRL_TDMAEN) != 0U)
        {
            /* Disable the QSPI DMA Tx request */
            CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_TDMAEN);

            /* Abort the QSPI DMA Tx channel */
            if (DAL_DMA_Abort(hqspi->hdmatx) != DAL_OK)
            {
                hqspi->ErrorCode |= DAL_QSPI_ERROR_DMA;
            }
        }

        if ((hqspi->Instance->DMACTRL & QSPI_DMACTRL_RDMAEN) != 0U)
        {
            /* Disable the QSPI DMA Rx request */
            CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_RDMAEN);

            /* Abort the QSPI DMA Rx channel */
            if (DAL_DMA_Abort(hqspi->hdmarx) != DAL_OK)
            {
                hqspi->ErrorCode |= DAL_QSPI_ERROR_DMA;
            }
        }

        if (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_BUSY) != RESET)
        {
            /* Disable slave select */
            __DAL_QSPI_DISABLE_SS(hqspi);

            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Wait till BUSY flag reset */
            status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, hqspi->Timeout);
        }
        else
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_READY;
        }
    }

