betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
    return status;
}

/**
 * @brief  Abort the current transmission (non-blocking mode).
 * @param  hqspi QSPI handle
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_Abort_IT(QSPI_HandleTypeDef *hqspi)
{
    DAL_StatusTypeDef status = DAL_OK;
    uint32_t tickstart = DAL_GetTick();

    /* Check if the state is in one of the busy states */
    if (((uint32_t)hqspi->State & 0x02) != 0U)
    {
        /* Process locked */
        __DAL_LOCK(hqspi);

        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_ABORT;

        /* Disable QSPI interrupts */
#if defined(QSPI_INTEN_MSTIE)
        __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_TFE \
                                     | QSPI_IT_TFO \
                                     | QSPI_IT_RFU \
                                     | QSPI_IT_RFO \
                                     | QSPI_IT_RFF \
                                     | QSPI_IT_MST);
#else
        __DAL_QSPI_DISABLE_IT(hqspi, QSPI_IT_TFE \
                                     | QSPI_IT_TFO \
                                     | QSPI_IT_RFU \
                                     | QSPI_IT_RFO \
                                     | QSPI_IT_RFF);
#endif /* QSPI_INTEN_MSTIE */
        if (hqspi->hdmatx != NULL)
        {
            if ((hqspi->Instance->DMACTRL & QSPI_DMACTRL_TDMAEN) != 0U)
            {
                /* Disable the QSPI DMA Tx request */
                CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_TDMAEN);

                /* Abort the QSPI DMA Tx channel */
                hqspi->hdmatx->XferAbortCallback = QSPI_DMAAbortCplt;
                if (DAL_DMA_Abort_IT(hqspi->hdmatx) != DAL_OK)
                {
                    /* Update QSPI state */
                    hqspi->State = DAL_QSPI_STATE_READY;

                    /* Abort completed callback */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
                    hqspi->AbortCpltCallback(hqspi);
#else
                    DAL_QSPI_AbortCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
                }
            }
            else
            {
                hqspi->hdmatx->XferAbortCallback = NULL;
            }
        }

        if (hqspi->hdmarx != NULL)
        {
            if ((hqspi->Instance->DMACTRL & QSPI_DMACTRL_RDMAEN) != 0U)
            {
                /* Disable the QSPI DMA Rx request */
                CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_RDMAEN);

                /* Abort the QSPI DMA Rx channel */
                hqspi->hdmarx->XferAbortCallback = QSPI_DMAAbortCplt;
                if (DAL_DMA_Abort_IT(hqspi->hdmarx) != DAL_OK)
                {
                    /* Update QSPI state */
                    hqspi->State = DAL_QSPI_STATE_READY;

                    /* Abort completed callback */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
                    hqspi->AbortCpltCallback(hqspi);
#else
                    DAL_QSPI_AbortCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
                }
            }
            else
            {
                hqspi->hdmarx->XferAbortCallback = NULL;
            }
        }

        if (__DAL_QSPI_GET_FLAG(hqspi, QSPI_FLAG_BUSY) != RESET)
        {
            /* Disable slave select */
            __DAL_QSPI_DISABLE_SS(hqspi);

            /* Disable the QSPI peripheral */
            __DAL_QSPI_DISABLE(hqspi);

            /* Wait till BUSY flag reset */
            status = DAL_QSPI_WaitFlagStateUntilTimeout(hqspi, QSPI_FLAG_BUSY, RESET, tickstart, hqspi->Timeout);
        }
        else
        {
            /* Update QSPI state */
            hqspi->State = DAL_QSPI_STATE_READY;
        }
    }

    return status;
}

/**
 * @brief  Set QSPI timeout.
 * @param  hqspi QSPI handle
 * @param  Timeout Timeout for the QSPI memory access
 * @retval None
 */
void DAL_QSPI_SetTimeout(QSPI_HandleTypeDef *hqspi, uint32_t Timeout)
{
    hqspi->Timeout = Timeout;
}

/**
 * @brief  Set QSPI TX Fifo threshold.
 * @param  hqspi QSPI handle
 * @param  Threshold threshold for the QSPI Fifo
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetTxFifoThreshold(QSPI_HandleTypeDef *hqspi, uint32_t Threshold)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_TX_FIFO_THRESHOLD(Threshold));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure FIFO threshold */
        MODIFY_REG(hqspi->Instance->TFTL, QSPI_TFTL_TFT, Threshold);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Set QSPI RX Fifo threshold.
 * @param  hqspi QSPI handle
 * @param  Threshold threshold for the QSPI Fifo
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetRxFifoThreshold(QSPI_HandleTypeDef *hqspi, uint32_t Threshold)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_RX_FIFO_THRESHOLD(Threshold));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure FIFO threshold */
        MODIFY_REG(hqspi->Instance->RFTL, QSPI_RFTL_RFT, Threshold);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @berief  Set QSPI Tx Fifo level.
 * @param  hqspi QSPI handle
 * @param  Level level for the QSPI Fifo
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetTxFifoLevel(QSPI_HandleTypeDef *hqspi, uint32_t Level)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_TX_FIFO_LEVEL(Level));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure FIFO level */
        MODIFY_REG(hqspi->Instance->TFTL, QSPI_TFTL_TFTH, Level);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

