betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Get QSPI Tx Fifo threshold.
 * @param  hqspi QSPI handle
 * @retval Threshold threshold for the QSPI Fifo
 */
uint32_t DAL_QSPI_GetTxFifoThreshold(QSPI_HandleTypeDef *hqspi)
{
    /* Return the FIFO threshold */
    return READ_BIT(hqspi->Instance->TFTL, QSPI_TFTL_TFT);
}

/**
 * @brief  Get QSPI Rx Fifo threshold.
 * @param  hqspi QSPI handle
 * @retval Threshold threshold for the QSPI Fifo
 */
uint32_t DAL_QSPI_GetRxFifoThreshold(QSPI_HandleTypeDef *hqspi)
{
    /* Return the FIFO threshold */
    return READ_BIT(hqspi->Instance->RFTL, QSPI_RFTL_RFT);
}

/**
 * @brief  Get QSPI Tx Fifo level.
 * @param  hqspi QSPI handle
 * @retval Level level for the QSPI Fifo
 */
uint32_t DAL_QSPI_GetTxFifoLevel(QSPI_HandleTypeDef *hqspi)
{
    /* Return the FIFO level */
    return READ_BIT(hqspi->Instance->TFTL, QSPI_TFTL_TFTH);
}

/**
 * @brief  Set QSPI frame format.
 * @param  hqspi QSPI handle
 * @param  FrameFormat frame format
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetFrameFormat(QSPI_HandleTypeDef *hqspi, uint32_t FrameFormat)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_FRAME_FORMAT(FrameFormat));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure frame format */
        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_FRF, FrameFormat);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Get QSPI frame format.
 * @param  hqspi QSPI handle
 * @retval FrameFormat frame format
 */
uint32_t DAL_QSPI_GetFrameFormat(QSPI_HandleTypeDef *hqspi)
{
    /* Return the frame format */
    return READ_BIT(hqspi->Instance->CTRL1, QSPI_CTRL1_FRF);
}

/**
 * @brief  Set QSPI frame data size.
 * @param  hqspi QSPI handle
 * @param  DataFrameSize frame data size
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetDataFrameSize(QSPI_HandleTypeDef *hqspi, uint32_t DataFrameSize)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_DATA_FRAME_SIZE(DataFrameSize));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure frame data size */
        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_DFS, DataFrameSize);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Get QSPI frame data size.
 * @param  hqspi QSPI handle
 * @retval DataFrameSize frame data size
 */
uint32_t DAL_QSPI_GetDataFrameSize(QSPI_HandleTypeDef *hqspi)
{
    /* Return the frame data size */
    return READ_BIT(hqspi->Instance->CTRL1, QSPI_CTRL1_DFS);
}

/**
 * @brief  Set QSPI transfer mode.
 * @param  hqspi QSPI handle
 * @param  TransferMode transfer mode
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetTransferMode(QSPI_HandleTypeDef *hqspi, uint32_t TransferMode)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_TRANSFER_MODE(TransferMode));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure transfer mode */
        MODIFY_REG(hqspi->Instance->CTRL1, QSPI_CTRL1_TXMODE, TransferMode);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Get QSPI transfer mode.
 * @param  hqspi QSPI handle
 * @retval TransferMode transfer mode
 */
uint32_t DAL_QSPI_GetTransferMode(QSPI_HandleTypeDef *hqspi)
{
    /* Return the transfer mode */
    return READ_BIT(hqspi->Instance->CTRL1, QSPI_CTRL1_TXMODE);
}

/**
 * @brief  Set QSPI number of data frames.
 * @param  hqspi QSPI handle
 * @param  NbData number of data frames
 * @retval DAL status
 */
DAL_StatusTypeDef DAL_QSPI_SetFrameNbData(QSPI_HandleTypeDef *hqspi, uint32_t NbData)
{
    DAL_StatusTypeDef status = DAL_OK;

    /* Process locked */
    __DAL_LOCK(hqspi);

    if (hqspi->State == DAL_QSPI_STATE_READY)
    {
        /* Check the parameters */
        ASSERT_PARAM(IS_QSPI_NB_DATA(NbData));

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);

        /* Configure number of data frames */
        MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, (NbData - 1) << QSPI_CTRL2_NDF_Pos);

        /* Enable the QSPI peripheral */
        __DAL_QSPI_ENABLE(hqspi);
    }
    else
    {
        status = DAL_BUSY;
    }

    /* Process unlocked */
    __DAL_UNLOCK(hqspi);

    return status;
}

/**
 * @brief  Get QSPI number of data frames.
 * @param  hqspi QSPI handle
 * @retval NbData number of data frames
 */
uint32_t DAL_QSPI_GetFrameNbData(QSPI_HandleTypeDef *hqspi)
{
    /* Return the number of data frames */
    return (READ_BIT(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF) >> QSPI_CTRL2_NDF_Pos) + 1U;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup QSPI_Private_Functions QSPI Private Functions
  * @{
  */

/**
 * @brief  DMA QSPI transmit process complete callback.
 * @param  hdma DMA handle
 * @retval None
 */
static void QSPI_DMATxCplt(DMA_HandleTypeDef *hdma)
{
    QSPI_HandleTypeDef *hqspi = (QSPI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

    /* DMA Normal mode */
    if ((hdma->Instance->SCFG & DMA_SCFGx_CIRCMEN) == 0U)
    {
        hqspi->TxXferCount = 0U;

