betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_qspi.c
        if (hqspi->State == DAL_QSPI_STATE_BUSY_TX)
        {
            /* Disable the QSPI DMA Tx request */
            CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_TDMAEN);

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            hqspi->TxCpltCallback(hqspi);
#else
            DAL_QSPI_TxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }

        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_READY;
    }
    /* DMA Circular mode */
    else
    {
        if (hqspi->State == DAL_QSPI_STATE_BUSY_TX)
        {
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            hqspi->TxCpltCallback(hqspi);
#else
            DAL_QSPI_TxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
    }
}

/**
 * @brief  DMA QSPI receive process complete callback.
 * @param  hdma DMA handle
 * @retval None
 */
static void QSPI_DMARxCplt(DMA_HandleTypeDef *hdma)
{
    QSPI_HandleTypeDef *hqspi = (QSPI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

    /* DMA Normal mode */
    if ((hdma->Instance->SCFG & DMA_SCFGx_CIRCMEN) == 0U)
    {
        hqspi->RxXferCount = 0U;

        if (hqspi->State == DAL_QSPI_STATE_BUSY_RX)
        {
            /* Disable the QSPI DMA Rx request */
            CLEAR_BIT(hqspi->Instance->DMACTRL, QSPI_DMACTRL_RDMAEN);

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            hqspi->RxCpltCallback(hqspi);
#else
            DAL_QSPI_RxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }

        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_READY;
    }
    /* DMA Circular mode */
    else
    {
        if (hqspi->State == DAL_QSPI_STATE_BUSY_RX)
        {
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
            hqspi->RxCpltCallback(hqspi);
#else
            DAL_QSPI_RxCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
        }
    }
}

/**
 * @brief  DMA QSPI communication error callback.
 * @param  hdma DMA handle
 * @retval None
 */
static void QSPI_DMAError(DMA_HandleTypeDef *hdma)
{
    QSPI_HandleTypeDef *hqspi = (QSPI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
    hqspi->RxXferCount = 0U;
    hqspi->TxXferCount = 0U;
    hqspi->ErrorCode |= DAL_QSPI_ERROR_DMA;

    /* Disable using DMA by clearing TDMAEN and RDMAEN bit in the QSPI DMACTRL register */
    CLEAR_BIT(hqspi->Instance->DMACTRL, (QSPI_DMACTRL_RDMAEN | QSPI_DMACTRL_TDMAEN));

    /* Abort the QSPI */
    (void)DAL_QSPI_Abort_IT(hqspi);
}

/**
 * @brief  DMA QSPI communication abort callback.
 * @param  hdma DMA handle
 * @retval None
 */
static void QSPI_DMAAbortCplt(DMA_HandleTypeDef *hdma)
{
    QSPI_HandleTypeDef *hqspi = (QSPI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

    hqspi->RxXferCount = 0U;
    hqspi->TxXferCount = 0U;

    if (hqspi->State == DAL_QSPI_STATE_ABORT)
    {
        /* Disable slave select */
        __DAL_QSPI_DISABLE_SS(hqspi);

        /* Disable the QSPI peripheral */
        __DAL_QSPI_DISABLE(hqspi);
    }
    else
    {
        /* Update QSPI state */
        hqspi->State = DAL_QSPI_STATE_READY;

        /* Error callback */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
        hqspi->AbortCpltCallback(hqspi);
#else
        DAL_QSPI_AbortCpltCallback(hqspi);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
    }
}

/**
 * @brief  Wait for a flag state until timeout
 * @param  hqspi: QSPI handle
 * @param  Flag: Flag checked
 * @param  State: Value of the flag expected
 * @param  TickStart: Tick start value
 * @param  Timeout: Timeout duration
 * @retval DAL status
 */
static DAL_StatusTypeDef DAL_QSPI_WaitFlagStateUntilTimeout(QSPI_HandleTypeDef *hqspi, uint32_t Flag, FlagStatus State, uint32_t TickStart, uint32_t Timeout)
{
    /* Wait until flag is in expected state */
    while ((__DAL_QSPI_GET_FLAG(hqspi, Flag)) != State)
    {
        /* Check for the Timeout */
        if (Timeout != DAL_MAX_DELAY)
        {
            if (((DAL_GetTick() - TickStart) > Timeout) || (Timeout == 0U))
            {
                hqspi->State = DAL_QSPI_STATE_ERROR;
                hqspi->ErrorCode |= DAL_QSPI_ERROR_TIMEOUT;

                return DAL_ERROR;
            }
        }
    }

    return DAL_OK;
}

/**
 * @brief  Configure the communication registers.
 * @param  hqspi: QSPI handle
 * @param  cmd: structure that contains the command configuration information
 * @retval None
 */
static void QSPI_Config(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd)
{
    if (cmd->FrameFormat == QSPI_FRAME_FORMAT_STANDARD)
    {
        /* Configure CTRL1 */
        MODIFY_REG(hqspi->Instance->CTRL1, \
                    (QSPI_CTRL1_FRF | QSPI_CTRL1_TXMODE), \
                    (cmd->FrameFormat | cmd->TransferMode));

        if (cmd->TransferMode == QSPI_TRANSFER_MODE_EEPROM_READ)
        {
            /* Configure CTRL2 */
            MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, (cmd->NbData) << QSPI_CTRL2_NDF_Pos);
        }
        else
        {
            /* Configure CTRL2 */
            MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, (cmd->NbData - 1) << QSPI_CTRL2_NDF_Pos);
        }
    }
    else if (cmd->FrameFormat == QSPI_FRAME_FORMAT_DUAL)
    {
        if ((cmd->TransferMode == QSPI_TRANSFER_MODE_TX) || (cmd->TransferMode == QSPI_TRANSFER_MODE_RX))
        {
            /* Configure CTRL1 */
            MODIFY_REG(hqspi->Instance->CTRL1, \
                        (QSPI_CTRL1_FRF | QSPI_CTRL1_TXMODE), \
                        (cmd->FrameFormat | cmd->TransferMode));

            /* Configure CTRL2 */
            if (cmd->NbData != 0)
            {
                MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, (cmd->NbData - 1) << QSPI_CTRL2_NDF_Pos);
            }
            else
            {
                MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, 0);
            }

            if (cmd->TransferMode == QSPI_TRANSFER_MODE_TX)
            {
                /* Configure CTRL3 */
                MODIFY_REG(hqspi->Instance->CTRL3, \
                            (QSPI_CTRL3_IAT | QSPI_CTRL3_ADDRLEN | QSPI_CTRL3_INSLEN), \
                            ((cmd->InstructionMode) | (cmd->AddressSize) | (cmd->InstructionSize)));
            }
            else
            {
                /* Configure CTRL3 */
                MODIFY_REG(hqspi->Instance->CTRL3, \
                            (QSPI_CTRL3_IAT | QSPI_CTRL3_ADDRLEN | QSPI_CTRL3_INSLEN | QSPI_CTRL3_WAITCYC), \
                            ((cmd->InstructionMode) | (cmd->AddressSize) | (cmd->InstructionSize) | (cmd->DummyCycles << QSPI_CTRL3_WAITCYC_Pos)));
            }
        }
    }
    else if (cmd->FrameFormat == QSPI_FRAME_FORMAT_QUAD)
    {
        if ((cmd->TransferMode == QSPI_TRANSFER_MODE_TX) || (cmd->TransferMode == QSPI_TRANSFER_MODE_RX))
        {
            /* Configure CTRL1 */
            MODIFY_REG(hqspi->Instance->CTRL1, \
                        (QSPI_CTRL1_FRF | QSPI_CTRL1_TXMODE), \
                        (cmd->FrameFormat | cmd->TransferMode));

            /* Configure CTRL2 */
            if (cmd->NbData != 0)
            {
                MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, (cmd->NbData - 1) << QSPI_CTRL2_NDF_Pos);
            }
            else
            {
                MODIFY_REG(hqspi->Instance->CTRL2, QSPI_CTRL2_NDF, 0);
            }

            if (cmd->TransferMode == QSPI_TRANSFER_MODE_TX)
            {
                /* Configure CTRL3 */
                MODIFY_REG(hqspi->Instance->CTRL3, \
                            (QSPI_CTRL3_IAT | QSPI_CTRL3_ADDRLEN | QSPI_CTRL3_INSLEN), \
                            ((cmd->InstructionMode) | (cmd->AddressSize) | (cmd->InstructionSize)));
            }
            else
            {
                /* Configure CTRL3 */
                MODIFY_REG(hqspi->Instance->CTRL3, \
                            (QSPI_CTRL3_IAT | QSPI_CTRL3_ADDRLEN | QSPI_CTRL3_INSLEN | QSPI_CTRL3_WAITCYC), \
                            ((cmd->InstructionMode) | (cmd->AddressSize) | (cmd->InstructionSize) | (cmd->DummyCycles << QSPI_CTRL3_WAITCYC_Pos)));
            }
        }
    }
    else
    {
        /* Nothing to do */
    }
}

/**
  * @}
  */

#endif /* DAL_QSPI_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

#endif /* QSPI */
